gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
/*
 * Copyright 2016 Silicon Laboratories, Inc. http://www.silabs.com
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.@n
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Laboratories, Inc.
 * has no obligation to support this Software. Silicon Laboratories, Inc. is
 * providing the Software "AS IS", with no express or implied warranties of any
 * kind, including, but not limited to, any implied warranties of
 * merchantability or fitness for any particular purpose or warranties against
 * infringement of any proprietary rights of a third party.
 *
 * Silicon Laboratories, Inc. will not be liable for any consequential,
 * incidental, or special damages, or any other relief, or for any claim by
 * any third party, arising from your use of this Software.
 *
 * Copyright (C) 2017 Sergei Glushchenko
 * Author: Sergei Glushchenko <gl.sergei@gmail.com>
 *
 * This file is a part of U2F firmware for STM32
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 * As additional permission under GNU GPL version 3 section 7, you may
 * distribute non-source form of the Program without the copy of the
 * GNU GPL normally required by section 4, provided you inform the
 * recipients of GNU GPL by a written offer.
 *
 */

/* Bit fields for CMU HFCORECLKEN0 */
#define CMU_HFCORECLKEN0_AES    (0x1UL << 0)  /* AES Accelerator */
#define CMU_HFCORECLKEN0_DMA    (0x1UL << 1)  /* DMA Controller */
#define CMU_HFCORECLKEN0_LE     (0x1UL << 2)  /* Low Energy Peripheral Interface */
#define CMU_HFCORECLKEN0_USBC   (0x1UL << 3)  /* USB Interface Core */
#define CMU_HFCORECLKEN0_USB    (0x1UL << 4)  /* USB Interface */

/* Bit fields for CMU HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TIMER0  (0x1UL << 0)  /* Timer 0 */
#define CMU_HFPERCLKEN0_TIMER1  (0x1UL << 1)  /* Timer 1 */
#define CMU_HFPERCLKEN0_TIMER2  (0x1UL << 2)  /* Timer 2 */
#define CMU_HFPERCLKEN0_USART0  (0x1UL << 3)  /* USART 0 */
#define CMU_HFPERCLKEN0_USART1  (0x1UL << 4)  /* USART 1 */
#define CMU_HFPERCLKEN0_ACMP0   (0x1UL << 5)  /* Analog Comparator 0 */
#define CMU_HFPERCLKEN0_PRS     (0x1UL << 6)  /* Peripheral Reflex System */
#define CMU_HFPERCLKEN0_IDAC0   (0x1UL << 7)  /* Current DAC 0 */
#define CMU_HFPERCLKEN0_GPIO    (0x1UL << 8)  /* General purpose IO */
#define CMU_HFPERCLKEN0_VCMP    (0x1UL << 9)  /* Voltage Comparator */
#define CMU_HFPERCLKEN0_ADC0    (0x1UL << 10) /* ADC 0 */
#define CMU_HFPERCLKEN0_I2C0    (0x1UL << 11) /* I2C 0 */

/* Bit fields for CMU OSCENCMD */
#define CMU_OSCENCMD_HFRCOEN      (0x1UL << 0)   /* HFRCO Enable */
#define CMU_OSCENCMD_HFRCODIS     (0x1UL << 1)   /* HFRCO Disable */
#define CMU_OSCENCMD_HFXOEN       (0x1UL << 2)   /* HFXO Enable */
#define CMU_OSCENCMD_HFXODIS      (0x1UL << 3)   /* HFXO Disable */
#define CMU_OSCENCMD_AUXHFRCOEN   (0x1UL << 4)   /* AUXHFRCO Enable */
#define CMU_OSCENCMD_AUXHFRCODIS  (0x1UL << 5)   /* AUXHFRCO Disable */
#define CMU_OSCENCMD_LFRCOEN      (0x1UL << 6)   /* LFRCO Enable */
#define CMU_OSCENCMD_LFRCODIS     (0x1UL << 7)   /* LFRCO Disable */
#define CMU_OSCENCMD_LFXOEN       (0x1UL << 8)   /* LFXO Enable */
#define CMU_OSCENCMD_LFXODIS      (0x1UL << 9)   /* LFXO Disable */
#define CMU_OSCENCMD_USHFRCOEN    (0x1UL << 10)  /* USHFRCO Enable */
#define CMU_OSCENCMD_USHFRCODIS   (0x1UL << 11)  /* USHFRCO Disable */

/* Bit fields for CMU LFCCLKEN0 */
#define CMU_LFCCLKEN0_USBLE       (0x1UL << 0)   /* USB LE Clock Clock Enable */

/* Bit fields for CMU USBCRCTRL */
#define CMU_USBCRCTRL_EN          (0x1UL << 0)   /* Clock Recovery Enable */
#define CMU_USBCRCTRL_LSMODE      (0x1UL << 1)   /* Low Speed Clock Recovery Mode */

/* Bit fields for CMU STATUS */
#define CMU_STATUS_HFRCOENS       (0x1UL << 0)   /* HFRCO Enable Status */
#define CMU_STATUS_HFRCORDY       (0x1UL << 1)   /* HFRCO Ready */
#define CMU_STATUS_HFXOENS        (0x1UL << 2)   /* HFXO Enable Status */
#define CMU_STATUS_HFXORDY        (0x1UL << 3)   /* HFXO Ready */
#define CMU_STATUS_AUXHFRCOENS    (0x1UL << 4)   /* AUXHFRCO Enable Status */
#define CMU_STATUS_AUXHFRCORDY    (0x1UL << 5)   /* AUXHFRCO Ready */
#define CMU_STATUS_LFRCOENS       (0x1UL << 6)   /* LFRCO Enable Status */
#define CMU_STATUS_LFRCORDY       (0x1UL << 7)   /* LFRCO Ready */
#define CMU_STATUS_LFXOENS        (0x1UL << 8)   /* LFXO Enable Status */
#define CMU_STATUS_LFXORDY        (0x1UL << 9)   /* LFXO Ready */
#define CMU_STATUS_HFRCOSEL       (0x1UL << 10)  /* HFRCO Selected */
#define CMU_STATUS_HFXOSEL        (0x1UL << 11)  /* HFXO Selected */
#define CMU_STATUS_LFRCOSEL       (0x1UL << 12)  /* LFRCO Selected */
#define CMU_STATUS_LFXOSEL        (0x1UL << 13)  /* LFXO Selected */
#define CMU_STATUS_CALBSY         (0x1UL << 14)  /* Calibration Busy */
#define CMU_STATUS_USBCLFXOSEL    (0x1UL << 16)  /* USBC LFXO Selected */
#define CMU_STATUS_USBCLFRCOSEL   (0x1UL << 17)  /* USBC LFRCO Selected */
#define CMU_STATUS_USBCUSHFRCOSEL (0x1UL << 18)  /* USBC USHFRCO Selected */
#define CMU_STATUS_USBCHFCLKSYNC  (0x1UL << 20)  /* USBC is synchronous to HFCLK */
#define CMU_STATUS_USHFRCOENS     (0x1UL << 21)  /* USHFRCO Enable Status */
#define CMU_STATUS_USHFRCORDY     (0x1UL << 22)  /* USHFRCO Ready */
#define CMU_STATUS_USHFRCOSUSPEND (0x1UL << 23)  /* USHFRCO is suspended */
#define CMU_STATUS_USHFRCODIV2SEL (0x1UL << 26)  /* USHFRCODIV2 Selected */

/* Bit fields for CMU USHFRCOCONF */
#define CMU_USHFRCOCONF_BAND_48MHZ     (1 << 0)     /* mode 48MHZ for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_BAND_24MHZ     (3 << 0)     /* mode 24MHZ for CMU_USHFRCOCONF */
#define CMU_USHFRCOCONF_USHFRCODIV2DIS (0x1UL << 4) /* USHFRCO divider for HFCLK disable */

/* Bit fields for CMU CMD */
#define CMU_CMD_HFCLKSEL_HFRCO       (0x1UL << 0)   /* mode HFRCO for CMU_CMD */
#define CMU_CMD_HFCLKSEL_HFXO        (0x2UL << 0)   /* mode HFXO for CMU_CMD */
#define CMU_CMD_HFCLKSEL_LFRCO       (0x3UL << 0)   /* mode LFRCO for CMU_CMD */
#define CMU_CMD_HFCLKSEL_LFXO        (0x4UL << 0)   /* mode LFXO for CMU_CMD */
#define CMU_CMD_HFCLKSEL_USHFRCODIV2 (0x5UL << 0)   /* mode USHFRCODIV2 for CMU_CMD */
#define CMU_CMD_CALSTART             (0x1UL << 3)   /* Calibration Start */
#define CMU_CMD_CALSTOP              (0x1UL << 4)   /* Calibration Stop */
#define CMU_CMD_USBCCLKSEL_LFXO      (0x2UL << 5)   /* mode LFXO for CMU_CMD */
#define CMU_CMD_USBCCLKSEL_LFRCO     (0x2UL << 5)   /* mode LFRCO for CMU_CMD */
#define CMU_CMD_USBCCLKSEL_USHFRCO   (0x4UL << 5)   /* mode USHFRCO for CMU_CMD */

/* Bit fields for USB CTRL */
#define USB_CTRL_DMPUAP             (0x1UL << 1)   /* DMPU Active Polarity */
#define USB_CTRL_LEMOSCCTRL_NONE    (0x01UL << 4)  /* mode NONE for USB_CTRL */
#define USB_CTRL_LEMOSCCTRL_GATE    (0x1UL << 4)   /* mode GATE for USB_CTRL */
#define USB_CTRL_LEMOSCCTRL_SUSPEND (0x2UL << 4)   /* mode SUSPEND for USB_CTRL */
#define USB_CTRL_LEMPHYCTRL         (0x1UL << 7)   /* Low Energy Mode USB PHY Control */
#define USB_CTRL_LEMIDLEEN          (0x1UL << 9)   /* Low Energy Mode on Bus Idle Enable */
#define USB_CTRL_LEMNAKEN           (0x1UL << 10)  /* Low Energy Mode on OUT NAK Enable */
#define USB_CTRL_LEMADDRMEN         (0x1UL << 11)  /* Low Energy Mode on Device Address Mismatch Enable */
#define USB_CTRL_VREGDIS            (0x1UL << 16)  /* Voltage Regulator Disable */
#define USB_CTRL_VREGOSEN           (0x1UL << 17)  /* VREGO Sense Enable */

/* Bit fields for USB STATUS */
#define USB_STATUS_VREGOS           (0x1UL << 0)   /* VREGO Sense Output */
#define USB_STATUS_LEMACTIVE        (0x1UL << 2)   /* Low Energy Mode Active */

/* Bit fields for USB IFS */
#define USB_IFS_VREGOSH             (0x1UL << 0)   /* Set VREGO Sense High Interrupt Flag */
#define USB_IFS_VREGOSL             (0x1UL << 1)   /* Set VREGO Sense Low Interrupt Flag */

/* Bit fields for USB IFC */
#define USB_IFC_VREGOSH             (0x1UL << 0)   /* Clear VREGO Sense High Interrupt Flag */
#define USB_IFC_VREGOSL             (0x1UL << 1)   /* Clear VREGO Sense Low Interrupt Flag */

