gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
/* Bit fields for USB IEN */
#define USB_IEN_VREGOSH             (0x1UL << 0)   /* VREGO Sense High Interrupt Enable */
#define USB_IEN_VREGOSL             (0x1UL << 1)   /* VREGO Sense Low Interrupt Enable */

/* Bit fields for USB ROUTE */
#define USB_ROUTE_PHYPEN            (0x1UL << 0)   /* USB PHY Pin Enable */
#define USB_ROUTE_DMPUPEN           (0x1UL << 2)   /* DMPU Pin Enable */

/* Bit fields for USB DCFG */
#define USB_DCFG_DEVSPD_MASK        0x3UL                /* Bit mask for USB_DEVSPD */
#define USB_DCFG_DEVSPD_LS          (0x00000002UL << 0)  /* mode LS for USB_DCFG */
#define USB_DCFG_DEVSPD_FS          (0x00000003UL << 0)  /* mode FS for USB_DCFG */
#define USB_DCFG_NZSTSOUTHSHK       (0x1UL << 2)         /* Non-Zero-Length Status OUT Handshake */
#define USB_DCFG_ENA32KHZSUSP       (0x1UL << 3)         /* Enable 32 KHz Suspend mode */
#define USB_DCFG_DEVADDR_MASK       0x7F0UL              /* Bit mask for USB_DEVADDR */
#define USB_DCFG_PERFRINT_MASK      0x1800UL             /* Bit mask for USB_PERFRINT */
#define USB_DCFG_PERFRINT_80PCNT    (0x00000000UL << 11) /* mode 80PCNT for USB_DCFG */
#define USB_DCFG_PERFRINT_85PCNT    (0x00000001UL << 11) /* mode 85PCNT for USB_DCFG */
#define USB_DCFG_PERFRINT_90PCNT    (0x00000002UL << 11) /* mode 90PCNT for USB_DCFG */
#define USB_DCFG_PERFRINT_95PCNT    (0x00000003UL << 11) /* mode 95PCNT for USB_DCFG */
#define USB_DCFG_ERRATICINTMSK      (0x1UL << 15)        /*  */
#define USB_DCFG_RESVALID_MASK      0xFC000000UL         /* Bit mask for USB_RESVALID */

/* Bit fields for USB DCTL */
#define USB_DCTL_MASK               0x00018FFFUL         /* Mask for USB_DCTL */
#define USB_DCTL_RMTWKUPSIG         (0x1UL << 0)         /* Remote Wakeup Signaling */
#define USB_DCTL_SFTDISCON          (0x1UL << 1)         /* Soft Disconnect */
#define USB_DCTL_GNPINNAKSTS        (0x1UL << 2)         /* Global Non-periodic IN NAK Status */
#define USB_DCTL_GOUTNAKSTS         (0x1UL << 3)         /* Global OUT NAK Status */
#define USB_DCTL_TSTCTL_MASK        0x70UL               /* Bit mask for USB_TSTCTL */
#define USB_DCTL_TSTCTL_DISABLE     (0x00000000UL << 4)  /* mode DISABLE for USB_DCTL */
#define USB_DCTL_TSTCTL_J           (0x00000001UL << 4)  /* mode J for USB_DCTL */
#define USB_DCTL_TSTCTL_K           (0x00000002UL << 4)  /* mode K for USB_DCTL */
#define USB_DCTL_TSTCTL_SE0NAK      (0x00000003UL << 4)  /* mode SE0NAK for USB_DCTL */
#define USB_DCTL_TSTCTL_PACKET      (0x00000004UL << 4)  /* mode PACKET for USB_DCTL */
#define USB_DCTL_TSTCTL_FORCE       (0x00000005UL << 4)  /* mode FORCE for USB_DCTL */
#define USB_DCTL_SGNPINNAK          (0x1UL << 7)         /* Set Global Non-periodic IN NAK */
#define USB_DCTL_CGNPINNAK          (0x1UL << 8)         /* Clear Global Non-periodic IN NAK */
#define USB_DCTL_SGOUTNAK           (0x1UL << 9)         /* Set Global OUT NAK */
#define USB_DCTL_CGOUTNAK           (0x1UL << 10)        /* Clear Global OUT NAK */
#define USB_DCTL_PWRONPRGDONE       (0x1UL << 11)        /* Power-On Programming Done */
#define USB_DCTL_IGNRFRMNUM         (0x1UL << 15)        /* Ignore Frame number For Isochronous End points */
#define USB_DCTL_NAKONBBLE          (0x1UL << 16)        /* NAK on Babble Error */

/* Bit fields for USB PCGCCTL */
#define USB_PCGCCTL_STOPPCLK        (0x1UL << 0)         /* Stop PHY clock */
#define USB_PCGCCTL_GATEHCLK        (0x1UL << 1)         /* Gate HCLK */
#define USB_PCGCCTL_PWRCLMP         (0x1UL << 2)         /* Power Clamp */
#define USB_PCGCCTL_RSTPDWNMODULE   (0x1UL << 3)         /* Reset Power-Down Modules */
#define USB_PCGCCTL_PHYSLEEP        (0x1UL << 6)         /* PHY In Sleep */

/* Bit fields for USB GRSTCTL */
#define USB_GRSTCTL_MASK            0xC00007F3UL         /* Mask for USB_GRSTCTL */
#define USB_GRSTCTL_CSFTRST         (0x1UL << 0)         /* Core Soft Reset */
#define USB_GRSTCTL_PIUFSSFTRST     (0x1UL << 1)         /* PIU FS Dedicated Controller Soft Reset */
#define USB_GRSTCTL_RXFFLSH         (0x1UL << 4)         /* RxFIFO Flush */
#define USB_GRSTCTL_TXFFLSH         (0x1UL << 5)         /* TxFIFO Flush */
#define USB_GRSTCTL_TXFNUM_MASK     0x7C0UL              /* Bit mask for USB_TXFNUM */
#define USB_GRSTCTL_TXFNUM_F0       (0x00000000UL << 6)  /* mode F0 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F1       (0x00000001UL << 6)  /* mode F1 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F2       (0x00000002UL << 6)  /* mode F2 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F3       (0x00000003UL << 6)  /* mode F3 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F4       (0x00000004UL << 6)  /* mode F4 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F5       (0x00000005UL << 6)  /* mode F5 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_F6       (0x00000006UL << 6)  /* mode F6 for USB_GRSTCTL */
#define USB_GRSTCTL_TXFNUM_FALL     (0x00000010UL << 6)  /* mode FALL for USB_GRSTCTL */
#define USB_GRSTCTL_DMAREQ          (0x1UL << 30)        /* DMA Request Signal */
#define USB_GRSTCTL_AHBIDLE         (0x1UL << 31)        /* AHB Master Idle */

/* Bit fields for USB GINTSTS */
#define USB_GINTSTS_CURMOD       (0x1UL << 0)   /* Current Mode of Operation */
#define USB_GINTSTS_SOF          (0x1UL << 3)   /* Start of Frame */
#define USB_GINTSTS_RXFLVL       (0x1UL << 4)   /* RxFIFO Non-Empty */
#define USB_GINTSTS_GINNAKEFF    (0x1UL << 6)   /* Global IN Non-periodic NAK Effective */
#define USB_GINTSTS_GOUTNAKEFF   (0x1UL << 7)   /* Global OUT NAK Effective */
#define USB_GINTSTS_ERLYSUSP     (0x1UL << 10)  /* Early Suspend */
#define USB_GINTSTS_USBSUSP      (0x1UL << 11)  /* USB Suspend */
#define USB_GINTSTS_USBRST       (0x1UL << 12)  /* USB Reset */
#define USB_GINTSTS_ENUMDONE     (0x1UL << 13)  /* Enumeration Done */
#define USB_GINTSTS_ISOOUTDROP   (0x1UL << 14)  /* Isochronous OUT Packet Dropped Interrupt */
#define USB_GINTSTS_EOPF         (0x1UL << 15)  /* End of Periodic Frame Interrupt */
#define USB_GINTSTS_IEPINT       (0x1UL << 18)  /* IN Endpoints Interrupt */
#define USB_GINTSTS_OEPINT       (0x1UL << 19)  /* OUT Endpoints Interrupt */
#define USB_GINTSTS_INCOMPISOIN  (0x1UL << 20)  /* Incomplete Isochronous IN Transfer */
#define USB_GINTSTS_INCOMPLP     (0x1UL << 21)  /* Incomplete Periodic Transfer */
#define USB_GINTSTS_FETSUSP      (0x1UL << 22)  /* Data Fetch Suspended */
#define USB_GINTSTS_RESETDET     (0x1UL << 23)  /* Reset detected Interrupt */
#define USB_GINTSTS_WKUPINT      (0x1UL << 31)  /* Resume/Remote Wakeup Detected Interrupt */

/* Bit fields for USB GAHBCFG */
#define USB_GAHBCFG_GLBLINTRMSK           (0x1UL << 0)          /* Global Interrupt Mask */
#define USB_GAHBCFG_HBSTLEN_MASK          0x1EUL                /* Bit mask for USB_HBSTLEN */
#define USB_GAHBCFG_HBSTLEN_SINGLE        (0x00000000UL << 1)   /* mode SINGLE for USB_GAHBCFG */
#define USB_GAHBCFG_HBSTLEN_INCR          (0x00000001UL << 1)   /* mode INCR for USB_GAHBCFG */
#define USB_GAHBCFG_HBSTLEN_INCR4         (0x00000003UL << 1)   /* mode INCR4 for USB_GAHBCFG */
#define USB_GAHBCFG_HBSTLEN_INCR8         (0x00000005UL << 1)   /* mode INCR8 for USB_GAHBCFG */
#define USB_GAHBCFG_HBSTLEN_INCR16        (0x00000007UL << 1)   /* mode INCR16 for USB_GAHBCFG */
#define USB_GAHBCFG_DMAEN                 (0x1UL << 5)          /* DMA Enable */
#define USB_GAHBCFG_NPTXFEMPLVL           (0x1UL << 7)          /* Non-Periodic TxFIFO Empty Level */
#define USB_GAHBCFG_NPTXFEMPLVL_MASK      0x80UL                /* Bit mask for USB_NPTXFEMPLVL */
#define USB_GAHBCFG_NPTXFEMPLVL_HALFEMPTY (0x00000000UL << 7)   /* mode HALFEMPTY for USB_GAHBCFG */
#define USB_GAHBCFG_NPTXFEMPLVL_EMPTY     (0x00000001UL << 7)   /* mode EMPTY for USB_GAHBCFG */
#define USB_GAHBCFG_REMMEMSUPP            (0x1UL << 21)         /* Remote Memory Support */
#define USB_GAHBCFG_NOTIALLDMAWRIT        (0x1UL << 22)         /* Notify All DMA Writes */
#define USB_GAHBCFG_AHBSINGLE             (0x1UL << 23)         /* AHB Single Support */

