gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
/* Bit fields for USB GINTMSK */
#define USB_GINTMSK_MODEMISMSK            (0x1UL << 1)    /* Mode Mismatch Interrupt Mask */
#define USB_GINTMSK_SOFMSK                (0x1UL << 3)    /* Start of Frame Mask */
#define USB_GINTMSK_RXFLVLMSK             (0x1UL << 4)    /* Receive FIFO Non-Empty Mask */
#define USB_GINTMSK_GINNAKEFFMSK          (0x1UL << 6)    /* Global Non-periodic IN NAK Effective Mask */
#define USB_GINTMSK_GOUTNAKEFFMSK         (0x1UL << 7)    /* Global OUT NAK Effective Mask */
#define USB_GINTMSK_ERLYSUSPMSK           (0x1UL << 10)   /* Early Suspend Mask */
#define USB_GINTMSK_USBSUSPMSK            (0x1UL << 11)   /* USB Suspend Mask */
#define USB_GINTMSK_USBRSTMSK             (0x1UL << 12)   /* USB Reset Mask */
#define USB_GINTMSK_ENUMDONEMSK           (0x1UL << 13)   /* Enumeration Done Mask */
#define USB_GINTMSK_ISOOUTDROPMSK         (0x1UL << 14)   /* Isochronous OUT Packet Dropped Interrupt Mask */
#define USB_GINTMSK_EOPFMSK               (0x1UL << 15)   /* End of Periodic Frame Interrupt Mask */
#define USB_GINTMSK_IEPINTMSK             (0x1UL << 18)   /* IN Endpoints Interrupt Mask */
#define USB_GINTMSK_OEPINTMSK             (0x1UL << 19)   /* OUT Endpoints Interrupt Mask */
#define USB_GINTMSK_INCOMPISOINMSK        (0x1UL << 20)   /* Incomplete Isochronous IN Transfer Mask */
#define USB_GINTMSK_INCOMPLPMSK           (0x1UL << 21)   /* Incomplete Periodic Transfer Mask */
#define USB_GINTMSK_FETSUSPMSK            (0x1UL << 22)   /* Data Fetch Suspended Mask */
#define USB_GINTMSK_RESETDETMSK           (0x1UL << 23)   /* Reset detected Interrupt Mask */
#define USB_GINTMSK_WKUPINTMSK            (0x1UL << 31)   /* Resume/Remote Wakeup Detected Interrupt Mask */

/* Bit fields for USB DAINTMSK */
#define USB_DAINTMSK_INEPMSK0      (0x1UL << 0)   /* IN Endpoint 0 Interrupt mask Bit */
#define USB_DAINTMSK_INEPMSK1      (0x1UL << 1)   /* IN Endpoint 1 Interrupt mask Bit */
#define USB_DAINTMSK_INEPMSK2      (0x1UL << 2)   /* IN Endpoint 2 Interrupt mask Bit */
#define USB_DAINTMSK_INEPMSK3      (0x1UL << 3)   /* IN Endpoint 3 Interrupt mask Bit */
#define USB_DAINTMSK_OUTEPMSK0     (0x1UL << 16)  /* OUT Endpoint 0 Interrupt mask Bit */
#define USB_DAINTMSK_OUTEPMSK1     (0x1UL << 17)  /* OUT Endpoint 1 Interrupt mask Bit */
#define USB_DAINTMSK_OUTEPMSK2     (0x1UL << 18)  /* OUT Endpoint 2 Interrupt mask Bit */
#define USB_DAINTMSK_OUTEPMSK3     (0x1UL << 19)  /* OUT Endpoint 3 Interrupt mask Bit */

/* Bit fields for USB DIEPMSK */
#define USB_DIEPMSK_XFERCOMPLMSK    (0x1UL << 0)  /* Transfer Completed Interrupt Mask */
#define USB_DIEPMSK_EPDISBLDMSK     (0x1UL << 1)  /* Endpoint Disabled Interrupt Mask */
#define USB_DIEPMSK_AHBERRMSK       (0x1UL << 2)  /* AHB Error Mask */
#define USB_DIEPMSK_TIMEOUTMSK      (0x1UL << 3)  /* Timeout Condition Mask */
#define USB_DIEPMSK_INTKNTXFEMPMSK  (0x1UL << 4)  /* IN Token Received When TxFIFO Empty Mask */
#define USB_DIEPMSK_INEPNAKEFFMSK   (0x1UL << 6)  /* IN Endpoint NAK Effective Mask */
#define USB_DIEPMSK_TXFIFOUNDRNMSK  (0x1UL << 8)  /* Fifo Underrun Mask */
#define USB_DIEPMSK_NAKMSK          (0x1UL << 13) /* NAK interrupt Mask */

/* Bit fields for USB DOEPMSK */
#define USB_DOEPMSK_XFERCOMPLMSK    (0x1UL << 0)  /* Transfer Completed Interrupt Mask */
#define USB_DOEPMSK_EPDISBLDMSK     (0x1UL << 1)  /* Endpoint Disabled Interrupt Mask */
#define USB_DOEPMSK_AHBERRMSK       (0x1UL << 2)  /* AHB Error */
#define USB_DOEPMSK_SETUPMSK        (0x1UL << 3)  /* SETUP Phase Done Mask */
#define USB_DOEPMSK_OUTTKNEPDISMSK  (0x1UL << 4)  /* OUT Token Received when Endpoint Disabled Mask */
#define USB_DOEPMSK_STSPHSERCVDMSK  (0x1UL << 5)  /* Status Phase Received Mask */
#define USB_DOEPMSK_BACK2BACKSETUP  (0x1UL << 6)  /* Back-to-Back SETUP Packets Received Mask */
#define USB_DOEPMSK_OUTPKTERRMSK    (0x1UL << 8)  /* OUT Packet Error Mask */
#define USB_DOEPMSK_BBLEERRMSK      (0x1UL << 12) /* Babble Error interrupt Mask */
#define USB_DOEPMSK_NAKMSK          (0x1UL << 13) /* NAK interrupt Mask */

/* Bit fields for USB DIEP_CTL */
#define USB_DIEP_CTL_USBACTEP           (0x1UL << 15)        /* USB Active Endpoint */
#define USB_DIEP_CTL_DPIDEOF            (0x1UL << 16)        /* Endpoint Data PID / Even or Odd Frame */
#define USB_DIEP_CTL_DPIDEOF_DATA0EVEN  (0 << 16)            /* mode DATA0EVEN for USB_DIEP_CTL */
#define USB_DIEP_CTL_DPIDEOF_DATA1ODD   (1 << 16)            /* mode DATA1ODD for USB_DIEP_CTL */
#define USB_DIEP_CTL_NAKSTS             (0x1UL << 17)        /* NAK Status */
#define USB_DIEP_CTL_NAKSTS_MASK        0x20000UL            /* Bit mask for USB_NAKSTS */
#define USB_DIEP_CTL_EPTYPE_MASK        0xC0000UL            /* Bit mask for USB_EPTYPE */
#define USB_DIEP_CTL_EPTYPE_CONTROL     (0x00000000UL << 18) /* mode CONTROL for USB_DIEP_CTL */
#define USB_DIEP_CTL_EPTYPE_ISO         (0x00000001UL << 18) /* mode ISO for USB_DIEP_CTL */
#define USB_DIEP_CTL_EPTYPE_BULK        (0x00000002UL << 18) /* mode BULK for USB_DIEP_CTL */
#define USB_DIEP_CTL_EPTYPE_INT         (0x00000003UL << 18) /* mode INT for USB_DIEP_CTL */
#define USB_DIEP_CTL_STALL              (0x1UL << 21)        /* Handshake */
#define USB_DIEP_CTL_TXFNUM_SHIFT       22                   /* Shift value for USB_TXFNUM */
#define USB_DIEP_CTL_TXFNUM_MASK        0x3C00000UL          /* Bit mask for USB_TXFNUM */
#define USB_DIEP_CTL_CNAK               (0x1UL << 26)        /* Clear NAK */
#define USB_DIEP_CTL_SNAK               (0x1UL << 27)        /* Set NAK */
#define USB_DIEP_CTL_SETD0PIDEF         (0x1UL << 28)        /* Set DATA0 PID / Even Frame */
#define USB_DIEP_CTL_SETD1PIDOF         (0x1UL << 29)        /* Set DATA1 PID / Odd Frame */
#define USB_DIEP_CTL_EPDIS              (0x1UL << 30)        /* Endpoint Disable */
#define USB_DIEP_CTL_EPENA              (0x1UL << 31)        /* Endpoint Enable */

/* Bit fields for USB DIEP_INT */
#define USB_DIEP_INT_MASK          0x000038DFUL   /* Mask for USB_DIEP_INT */
#define USB_DIEP_INT_XFERCOMPL     (0x1UL << 0)   /* Transfer Completed Interrupt */
#define USB_DIEP_INT_EPDISBLD      (0x1UL << 1)   /* Endpoint Disabled Interrupt */
#define USB_DIEP_INT_AHBERR        (0x1UL << 2)   /* AHB Error */
#define USB_DIEP_INT_TIMEOUT       (0x1UL << 3)   /* Timeout Condition */
#define USB_DIEP_INT_INTKNTXFEMP   (0x1UL << 4)   /* IN Token Received When TxFIFO is Empty */
#define USB_DIEP_INT_INEPNAKEFF    (0x1UL << 6)   /* IN Endpoint NAK Effective */
#define USB_DIEP_INT_TXFEMP        (0x1UL << 7)   /* Transmit FIFO Empty */
#define USB_DIEP_INT_PKTDRPSTS     (0x1UL << 11)  /* Packet Drop Status */
#define USB_DIEP_INT_BBLEERR       (0x1UL << 12)  /* NAK Interrupt */
#define USB_DIEP_INT_NAKINTRPT     (0x1UL << 13)  /* NAK Interrupt */

