gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
/* Bit fields for USB DIEP0CTL */
#define USB_DIEP0CTL_MPS_MASK       0x3UL                /* Bit mask for USB_MPS */
#define USB_DIEP0CTL_MPS_64B        (0x00000000UL << 0)  /* mode 64B for USB_DIEP0CTL */
#define USB_DIEP0CTL_MPS_32B        (0x00000001UL << 0)  /* mode 32B for USB_DIEP0CTL */
#define USB_DIEP0CTL_MPS_16B        (0x00000002UL << 0)  /* mode 16B for USB_DIEP0CTL */
#define USB_DIEP0CTL_MPS_8B         (0x00000003UL << 0)  /* mode 8B for USB_DIEP0CTL */
#define USB_DIEP0CTL_USBACTEP       (0x1UL << 15)        /* USB Active Endpoint */
#define USB_DIEP0CTL_NAKSTS         (0x1UL << 17)        /* NAK Status */
#define USB_DIEP0CTL_STALL          (0x1UL << 21)        /* Handshake */
#define USB_DIEP0CTL_TXFNUM_SHIFT   22                   /* Shift value for USB_TXFNUM */
#define USB_DIEP0CTL_TXFNUM_MASK    0x3C00000UL          /* Bit mask for USB_TXFNUM */
#define USB_DIEP0CTL_CNAK           (0x1UL << 26)        /* Clear NAK */
#define USB_DIEP0CTL_SNAK           (0x1UL << 27)        /* Set NAK */
#define USB_DIEP0CTL_EPDIS          (0x1UL << 30)        /* Endpoint Disable */
#define USB_DIEP0CTL_EPENA          (0x1UL << 31)        /* Endpoint Enable */

/* Bit fields for USB DIEP0INT */
#define USB_DIEP0INT_XFERCOMPL    (0x1UL << 0)   /* Transfer Completed Interrupt */
#define USB_DIEP0INT_EPDISBLD     (0x1UL << 1)   /* Endpoint Disabled Interrupt */
#define USB_DIEP0INT_AHBERR       (0x1UL << 2)   /* AHB Error */
#define USB_DIEP0INT_TIMEOUT      (0x1UL << 3)   /* Timeout Condition */
#define USB_DIEP0INT_INTKNTXFEMP  (0x1UL << 4)   /* IN Token Received When TxFIFO is Empty */
#define USB_DIEP0INT_INEPNAKEFF   (0x1UL << 6)   /* IN Endpoint NAK Effective */
#define USB_DIEP0INT_TXFEMP       (0x1UL << 7)   /* Transmit FIFO Empty */
#define USB_DIEP0INT_PKTDRPSTS    (0x1UL << 11)  /* Packet Drop Status */
#define USB_DIEP0INT_BBLEERR      (0x1UL << 12)  /* NAK Interrupt */
#define USB_DIEP0INT_NAKINTRPT    (0x1UL << 13)  /* NAK Interrupt */

/* Bit fields for USB DOEP_CTL */
#define USB_DOEP_CTL_MPS_MASK       0x7FFUL              /* Bit mask for USB_MPS */
#define USB_DOEP_CTL_USBACTEP       (0x1UL << 15)        /* USB Active Endpoint */
#define USB_DOEP_CTL_DPIDEOF        (0x1UL << 16)        /* Endpoint Data PID / Even-odd Frame */
#define USB_DOEP_CTL_NAKSTS         (0x1UL << 17)        /* NAK Status */
#define USB_DOEP_CTL_EPTYPE_SHIFT   18                   /* Shift value for USB_EPTYPE */
#define USB_DOEP_CTL_EPTYPE_MASK    0xC0000UL            /* Bit mask for USB_EPTYPE */
#define USB_DOEP_CTL_EPTYPE_CONTROL (0x00000000UL << 18) /* mode CONTROL for USB_DOEP_CTL */
#define USB_DOEP_CTL_EPTYPE_ISO     (0x00000001UL << 18) /* mode ISO for USB_DOEP_CTL */
#define USB_DOEP_CTL_EPTYPE_BULK    (0x00000002UL << 18) /* mode BULK for USB_DOEP_CTL */
#define USB_DOEP_CTL_EPTYPE_INT     (0x00000003UL << 18) /* mode INT for USB_DOEP_CTL */
#define USB_DOEP_CTL_SNP            (0x1UL << 20)        /* Snoop Mode */
#define USB_DOEP_CTL_STALL          (0x1UL << 21)        /* STALL Handshake */
#define USB_DOEP_CTL_CNAK           (0x1UL << 26)        /* Clear NAK */
#define USB_DOEP_CTL_SNAK           (0x1UL << 27)        /* Set NAK */
#define USB_DOEP_CTL_SETD0PIDEF     (0x1UL << 28)        /* Set DATA0 PID / Even Frame */
#define USB_DOEP_CTL_SETD1PIDOF     (0x1UL << 29)        /* Set DATA1 PID / Odd Frame */
#define USB_DOEP_CTL_EPDIS          (0x1UL << 30)        /* Endpoint Disable */
#define USB_DOEP_CTL_EPENA          (0x1UL << 31)        /* Endpoint Enable */

/* Bit fields for USB DOEP_INT */
#define USB_DOEP_INT_XFERCOMPL       (0x1UL << 0)   /* Transfer Completed Interrupt */
#define USB_DOEP_INT_EPDISBLD        (0x1UL << 1)   /* Endpoint Disabled Interrupt */
#define USB_DOEP_INT_AHBERR          (0x1UL << 2)   /* AHB Error */
#define USB_DOEP_INT_SETUP           (0x1UL << 3)   /* Setup Phase Done */
#define USB_DOEP_INT_OUTTKNEPDIS     (0x1UL << 4)   /* OUT Token Received When Endpoint Disabled */
#define USB_DOEP_INT_STSPHSERCVD     (0x1UL << 5)   /* Status Phase Received For Control Write */
#define USB_DOEP_INT_BACK2BACKSETUP  (0x1UL << 6)   /* Back-to-Back SETUP Packets Received */
#define USB_DOEP_INT_PKTDRPSTS       (0x1UL << 11)  /* Packet Drop Status */
#define USB_DOEP_INT_BBLEERR         (0x1UL << 12)  /* Babble Error */
#define USB_DOEP_INT_NAKINTRPT       (0x1UL << 13)  /* NAK Interrupt */
#define USB_DOEP_INT_STUPPKTRCVD     (0x1UL << 15)  /* Setup Packet Received */

/* Bit fields for USB DOEP0CTL */
#define USB_DOEP0CTL_MPS_64B        (0x00000000UL << 0)  /* mode 64B for USB_DOEP0CTL */
#define USB_DOEP0CTL_MPS_32B        (0x00000001UL << 0)  /* mode 32B for USB_DOEP0CTL */
#define USB_DOEP0CTL_MPS_16B        (0x00000002UL << 0)  /* mode 16B for USB_DOEP0CTL */
#define USB_DOEP0CTL_MPS_8B         (0x00000003UL << 0)  /* mode 8B for USB_DOEP0CTL */
#define USB_DOEP0CTL_USBACTEP       (0x1UL << 15)        /* USB Active Endpoint */
#define USB_DOEP0CTL_NAKSTS         (0x1UL << 17)        /* NAK Status */
#define USB_DOEP0CTL_SNP            (0x1UL << 20)        /* Snoop Mode */
#define USB_DOEP0CTL_STALL          (0x1UL << 21)        /* Handshake */
#define USB_DOEP0CTL_CNAK           (0x1UL << 26)        /* Clear NAK */
#define USB_DOEP0CTL_SNAK           (0x1UL << 27)        /* Set NAK */
#define USB_DOEP0CTL_EPDIS          (0x1UL << 30)        /* Endpoint Disable */
#define USB_DOEP0CTL_EPENA          (0x1UL << 31)        /* Endpoint Enable */

/* Bit fields for USB DOEP0INT */
#define USB_DOEP0INT_XFERCOMPL       (0x1UL << 0)   /* Transfer Completed Interrupt */
#define USB_DOEP0INT_EPDISBLD        (0x1UL << 1)   /* Endpoint Disabled Interrupt */
#define USB_DOEP0INT_AHBERR          (0x1UL << 2)   /* AHB Error */
#define USB_DOEP0INT_SETUP           (0x1UL << 3)   /* Setup Phase Done */
#define USB_DOEP0INT_OUTTKNEPDIS     (0x1UL << 4)   /* OUT Token Received When Endpoint Disabled */
#define USB_DOEP0INT_STSPHSERCVD     (0x1UL << 5)   /* Status Phase Received For Control Write */
#define USB_DOEP0INT_BACK2BACKSETUP  (0x1UL << 6)   /* Back-to-Back SETUP Packets Received */
#define USB_DOEP0INT_PKTDRPSTS       (0x1UL << 11)  /* Packet Drop Status */
#define USB_DOEP0INT_BBLEERR         (0x1UL << 12)  /* NAK Interrupt */
#define USB_DOEP0INT_NAKINTRPT       (0x1UL << 13)  /* NAK Interrupt */
#define USB_DOEP0INT_STUPPKTRCVD     (0x1UL << 15)  /* Setup Packet Received */

/* Bit fields for USB DOEP0TSIZ */
#define USB_DOEP0TSIZ_XFERSIZE_SHIFT 0             /* Shift value for USB_XFERSIZE */
#define USB_DOEP0TSIZ_XFERSIZE_MASK  0x7FUL        /* Bit mask for USB_XFERSIZE */
#define USB_DOEP0TSIZ_PKTCNT_SHIFT   19            /* Shift value for USB_PKTCNT */
#define USB_DOEP0TSIZ_PKTCNT_MASK    0x80000UL     /* Bit mask for USB_PKTCNT */
#define USB_DOEP0TSIZ_SUPCNT_SHIFT   29            /* Shift value for USB_SUPCNT */
#define USB_DOEP0TSIZ_SUPCNT_MASK    0x60000000UL  /* Bit mask for USB_SUPCNT */

/* Bit fields for USB GRXSTSP */
#define USB_GRXSTSP_CHEPNUM_SHIFT     0                     /* Shift value for USB_CHEPNUM */
#define USB_GRXSTSP_CHEPNUM_MASK      0xFUL                 /* Bit mask for USB_CHEPNUM */
#define USB_GRXSTSP_BCNT_SHIFT        4                     /* Shift value for USB_BCNT */
#define USB_GRXSTSP_BCNT_MASK         0x7FF0UL              /* Bit mask for USB_BCNT */
#define USB_GRXSTSP_DPID_SHIFT        15                    /* Shift value for USB_DPID */
#define USB_GRXSTSP_DPID_DATA0        (0x00000000UL << 15)  /* mode DATA0 for USB_GRXSTSP */
#define USB_GRXSTSP_DPID_DATA1        (0x00000001UL << 15)  /* mode DATA1 for USB_GRXSTSP */
#define USB_GRXSTSP_DPID_DATA2        (0x00000002UL << 15)  /* mode DATA2 for USB_GRXSTSP */
#define USB_GRXSTSP_DPID_MDATA        (0x00000003UL << 15)  /* mode MDATA for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_MASK       0x1E0000UL            /* Bit mask for USB_PKTSTS */
#define USB_GRXSTSP_PKTSTS_GOUTNAK    (0x00000001UL << 17)  /* mode GOUTNAK for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_PKTRCV     (0x00000002UL << 17)  /* mode PKTRCV for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_XFERCOMPL  (0x00000003UL << 17)  /* mode XFERCOMPL for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_SETUPCOMPL (0x00000004UL << 17)  /* mode SETUPCOMPL for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_TGLERR     (0x00000005UL << 17)  /* mode TGLERR for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_SETUPRCV   (0x00000006UL << 17)  /* mode SETUPRCV for USB_GRXSTSP */
#define USB_GRXSTSP_PKTSTS_CHLT       (0x00000007UL << 17)  /* mode CHLT for USB_GRXSTSP */
#define USB_GRXSTSP_FN_SHIFT          21                    /* Shift value for USB_FN */
#define USB_GRXSTSP_FN_MASK           0x1E00000UL           /* Bit mask for USB_FN */

/* Bit fields for ADC CMD */
#define ADC_CMD_SINGLESTART   (0x1UL << 0)  /* Single Conversion Start */
#define ADC_CMD_SINGLESTOP    (0x1UL << 1)  /* Single Conversion Stop */
#define ADC_CMD_SCANSTART     (0x1UL << 2)  /* Scan Sequence Start */
#define ADC_CMD_SCANSTOP      (0x1UL << 3)  /* Scan Sequence Stop */

