gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
/* Bit fields for ADC STATUS */
#define ADC_STATUS_SINGLEACT        (0x1UL << 0)          /* Single Conversion Active */
#define ADC_STATUS_SCANACT          (0x1UL << 1)          /* Scan Conversion Active */
#define ADC_STATUS_SINGLEREFWARM    (0x1UL << 8)          /* Single Reference Warmed Up */
#define ADC_STATUS_SCANREFWARM      (0x1UL << 9)          /* Scan Reference Warmed Up */
#define ADC_STATUS_WARM             (0x1UL << 12)         /* ADC Warmed Up */
#define ADC_STATUS_SINGLEDV         (0x1UL << 16)         /* Single Sample Data Valid */
#define ADC_STATUS_SCANDV           (0x1UL << 17)         /* Scan Data Valid */
#define ADC_STATUS_SCANDATASRC_CH0  (0x00000000UL << 24)  /* CH0 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH1  (0x00000001UL << 24)  /* CH1 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH2  (0x00000002UL << 24)  /* CH2 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH3  (0x00000003UL << 24)  /* CH3 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH4  (0x00000004UL << 24)  /* CH4 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH5  (0x00000005UL << 24)  /* CH5 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH6  (0x00000006UL << 24)  /* CH6 scan is ready */
#define ADC_STATUS_SCANDATASRC_CH7  (0x00000007UL << 24)  /* CH7 scan is ready */

/* Bit fields for ADC IEN */
#define ADC_IEN_SINGLE       (0x1UL << 0)  /* Single Conversion Complete */
#define ADC_IEN_SCAN         (0x1UL << 1)  /* Scan Conversion Complete */
#define ADC_IEN_SINGLEOF     (0x1UL << 8)  /* Single Result Overflow */
#define ADC_IEN_SCANOF       (0x1UL << 9)  /* Scan Result Overflow */

/* Bit fields for ADC IF */
#define ADC_IF_SINGLE        (0x1UL << 0)  /* Single Conversion Complete */
#define ADC_IF_SCAN          (0x1UL << 1)  /* Scan Conversion Complete */
#define ADC_IF_SINGLEOF      (0x1UL << 8)  /* Single Result Overflow */
#define ADC_IF_SCANOF        (0x1UL << 9)  /* Scan Result Overflow */

/* Bit fields for ADC IFS */
#define ADC_IFS_SINGLE       (0x1UL << 0)  /* Single Conversion Complete */
#define ADC_IFS_SCAN         (0x1UL << 1)  /* Scan Conversion Complete */
#define ADC_IFS_SINGLEOF     (0x1UL << 8)  /* Single Result Overflow */
#define ADC_IFS_SCANOF       (0x1UL << 9)  /* Scan Result Overflow */

/* Bit fields for ADC IFC */
#define ADC_IFC_SINGLE       (0x1UL << 0)  /* Single Conversion Complete */
#define ADC_IFC_SCAN         (0x1UL << 1)  /* Scan Conversion Complete */
#define ADC_IFC_SINGLEOF     (0x1UL << 8)  /* Single Result Overflow */
#define ADC_IFC_SCANOF       (0x1UL << 9)  /* Scan Result Overflow */

/* Limits imposed by the USB peripheral */
#define NP_RX_QUE_DEPTH       8
#define HP_RX_QUE_DEPTH       8
#define MAX_XFER_LEN          524287L         /* 2^19 - 1 bytes */
#define MAX_PACKETS_PR_XFER   1023            /* 2^10 - 1 packets */
#define MAX_NUM_TX_FIFOS      3               /* In addition to EP0 Tx FIFO */
#define MAX_NUM_IN_EPS        3               /* In addition to EP0 */
#define MAX_NUM_OUT_EPS       3               /* In addition to EP0 */
#define MAX_DEVICE_FIFO_SIZE_INWORDS 384U
#define MIN_EP_FIFO_SIZE_INWORDS  16U         /* Unit is words (32bit) */
#define MIN_EP_FIFO_SIZE_INBYTES  64U         /* Unit is bytes (8bit) */

/* Bit fields for MSC WRITECTRL */
#define MSC_WRITECTRL_WREN           (0x1UL << 0) /* Enable Write/Erase Controller */
#define MSC_WRITECTRL_IRQERASEABORT  (0x1UL << 1) /* Abort Page Erase on Interrupt */

/* Bit fields for MSC TIMEBASE */
#define MSC_TIMEBASE_PERIOD_1US  (0x00000000UL << 16)  /* mode 1US for MSC_TIMEBASE */
#define MSC_TIMEBASE_PERIOD_5US  (0x00000001UL << 16)  /* mode 5US for MSC_TIMEBASE */

/* Bit fields for MSC WRITECMD */
#define MSC_WRITECMD_LADDRIM     (0x1UL << 0)  /* Load MSC_ADDRB into ADDR */
#define MSC_WRITECMD_ERASEPAGE   (0x1UL << 1)  /* Erase Page */
#define MSC_WRITECMD_WRITEEND    (0x1UL << 2)  /* End Write Mode */
#define MSC_WRITECMD_WRITEONCE   (0x1UL << 3)  /* Word Write-Once Trigger */
#define MSC_WRITECMD_WRITETRIG   (0x1UL << 4)  /* Word Write Sequence Trigger */
#define MSC_WRITECMD_ERASEABORT  (0x1UL << 5)  /* Abort erase sequence */
#define MSC_WRITECMD_ERASEMAIN0  (0x1UL << 8)  /* Mass erase region 0 */
#define MSC_WRITECMD_CLEARWDATA  (0x1UL << 12) /* Clear WDATA state */

/* Bit fields for MSC STATUS */
#define MSC_STATUS_BUSY         (0x1UL << 0)  /* Erase/Write Busy */
#define MSC_STATUS_LOCKED       (0x1UL << 1)  /* Access Locked */
#define MSC_STATUS_INVADDR      (0x1UL << 2)  /* Invalid Write Address or Erase Page */
#define MSC_STATUS_WDATAREADY   (0x1UL << 3)  /* WDATA Write Ready */
#define MSC_STATUS_WORDTIMEOUT  (0x1UL << 4)  /* Flash Write Word Timeout */
#define MSC_STATUS_ERASEABORTED (0x1UL << 5)  /* The Current Flash Erase Operation Aborted */
#define MSC_STATUS_PCRUNNING    (0x1UL << 6)  /* Performance Counters Running */

#define MSC_UNLOCK_CODE      0x1B71 /* MSC unlock code */

struct CMU
{
  volatile uint32_t CTRL;          /* CMU Control Register */
  volatile uint32_t HFCORECLKDIV;  /* High Frequency Core Clock Division Register */
  volatile uint32_t HFPERCLKDIV;   /* High Frequency Peripheral Clock Division Register */
  volatile uint32_t HFRCOCTRL;     /* HFRCO Control Register */
  volatile uint32_t LFRCOCTRL;     /* LFRCO Control Register */
  volatile uint32_t AUXHFRCOCTRL;  /* AUXHFRCO Control Register */
  volatile uint32_t CALCTRL;       /* Calibration Control Register */
  volatile uint32_t CALCNT;        /* Calibration Counter Register */
  volatile uint32_t OSCENCMD;      /* Oscillator Enable/Disable Command Register */
  volatile uint32_t CMD;           /* Command Register */
  volatile uint32_t LFCLKSEL;      /* Low Frequency Clock Select Register */
  volatile const uint32_t STATUS;  /* Status Register */
  volatile const uint32_t IF;      /* Interrupt Flag Register */
  volatile uint32_t IFS;           /* Interrupt Flag Set Register */
  volatile uint32_t IFC;           /* Interrupt Flag Clear Register */
  volatile uint32_t IEN;           /* Interrupt Enable Register */
  volatile uint32_t HFCORECLKEN0;  /* High Frequency Core Clock Enable Register 0 */
  volatile uint32_t HFPERCLKEN0;   /* High Frequency Peripheral Clock Enable Register 0 */
  uint32_t RESERVED0[2];           /* Reserved for future use */
  volatile const uint32_t SYNCBUSY;/* Synchronization Busy Register */
  volatile uint32_t FREEZE;        /* Freeze Register */
  volatile uint32_t LFACLKEN0;     /* Low Frequency A Clock Enable Register 0  (Async Reg) */
  uint32_t RESERVED1[1];           /* Reserved for future use */
  volatile uint32_t LFBCLKEN0;     /* Low Frequency B Clock Enable Register 0 (Async Reg) */
  volatile uint32_t LFCCLKEN0;     /* Low Frequency C Clock Enable Register 0 (Async Reg) */
  volatile uint32_t LFAPRESC0;     /* Low Frequency A Prescaler Register 0 (Async Reg) */
  uint32_t RESERVED2[1];           /* Reserved for future use */
  volatile uint32_t LFBPRESC0;     /* Low Frequency B Prescaler Register 0  (Async Reg) */
  uint32_t RESERVED3[1];           /* Reserved for future use */
  volatile uint32_t PCNTCTRL;      /* PCNT Control Register */

  uint32_t RESERVED4[1];           /* Reserved for future use */
  volatile uint32_t ROUTE;         /* I/O Routing Register */
  volatile uint32_t LOCK;          /* Configuration Lock Register */

  uint32_t RESERVED5[18];          /* Reserved for future use */
  volatile uint32_t USBCRCTRL;     /* USB Clock Recovery Control */
  volatile uint32_t USHFRCOCTRL;   /* USHFRCO Control */
  volatile uint32_t USHFRCOTUNE;   /* USHFRCO Frequency Tune */
  volatile uint32_t USHFRCOCONF;   /* USHFRCO Configuration */
};

#define CMU_BASE 0x400C8000UL            /* CMU base address */
#define CMU ((struct CMU *) CMU_BASE)    /* CMU base pointer */


