gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
struct GPIO_P
{
  volatile uint32_t CTRL;              /* Port Control Register */
  volatile uint32_t MODEL;             /* Port Pin Mode Low Register */
  volatile uint32_t MODEH;             /* Port Pin Mode High Register */
  volatile uint32_t DOUT;              /* Port Data Out Register */
  volatile uint32_t DOUTSET;           /* Port Data Out Set Register */
  volatile uint32_t DOUTCLR;           /* Port Data Out Clear Register */
  volatile uint32_t DOUTTGL;           /* Port Data Out Toggle Register */
  volatile const uint32_t DIN;         /* Port Data In Register */
  volatile uint32_t PINLOCKN;          /* Port Unlocked Pins Register */
};

struct GPIO
{
  struct GPIO_P P[6];                  /* Port configuration bits */

  uint32_t RESERVED0[10];              /* Reserved for future use */
  volatile uint32_t EXTIPSELL;         /* External Interrupt Port Select Low Register */
  volatile uint32_t EXTIPSELH;         /* External Interrupt Port Select High Register */
  volatile uint32_t EXTIRISE;          /* External Interrupt Rising Edge Trigger Register */
  volatile uint32_t EXTIFALL;          /* External Interrupt Falling Edge Trigger Register */
  volatile uint32_t IEN;               /* Interrupt Enable Register */
  volatile const uint32_t IF;          /* Interrupt Flag Register */
  volatile uint32_t IFS;               /* Interrupt Flag Set Register */
  volatile uint32_t IFC;               /* Interrupt Flag Clear Register */

  volatile uint32_t ROUTE;             /* I/O Routing Register */
  volatile uint32_t INSENSE;           /* Input Sense Register */
  volatile uint32_t LOCK;              /* Configuration Lock Register */
  volatile uint32_t CTRL;              /* GPIO Control Register */
  volatile uint32_t CMD;               /* GPIO Command Register */
  volatile uint32_t EM4WUEN;           /* EM4 Wake-up Enable Register */
  volatile uint32_t EM4WUPOL;          /* EM4 Wake-up Polarity Register */
  volatile const uint32_t EM4WUCAUSE;  /* EM4 Wake-up Cause Register */
};

#define GPIO_BASE 0x40006000UL             /* GPIO base address */
#define GPIO ((struct GPIO *) GPIO_BASE)   /* GPIO base pointer */


struct TIMER_CC
{
  volatile uint32_t CTRL;          /* CC Channel Control Register */
  volatile uint32_t CCV;           /* CC Channel Value Register */
  volatile const uint32_t CCVP;    /* CC Channel Value Peek Register */
  volatile uint32_t CCVB;          /* CC Channel Buffer Register */
};

struct TIMER
{
  volatile uint32_t CTRL;          /* Control Register */
  volatile uint32_t CMD;           /* Command Register */
  volatile const uint32_t STATUS;  /* Status Register */
  volatile uint32_t IEN;           /* Interrupt Enable Register */
  volatile const uint32_t IF;      /* Interrupt Flag Register */
  volatile uint32_t IFS;           /* Interrupt Flag Set Register */
  volatile uint32_t IFC;           /* Interrupt Flag Clear Register */
  volatile uint32_t TOP;           /* Counter Top Value Register */
  volatile uint32_t TOPB;          /* Counter Top Value Buffer Register */
  volatile uint32_t CNT;           /* Counter Value Register */
  volatile uint32_t ROUTE;         /* I/O Routing Register */

  uint32_t RESERVED0[1];           /* Reserved registers */
  struct TIMER_CC CC[3];           /* Compare/Capture Channel */

  uint32_t RESERVED1[4];           /* Reserved for future use */
  volatile uint32_t DTCTRL;        /* DTI Control Register */
  volatile uint32_t DTTIME;        /* DTI Time Control Register */
  volatile uint32_t DTFC;          /* DTI Fault Configuration Register */
  volatile uint32_t DTOGEN;        /* DTI Output Generation Enable Register */
  volatile const uint32_t DTFAULT; /* DTI Fault Register */
  volatile uint32_t DTFAULTC;     /* DTI Fault Clear Register */
  volatile uint32_t DTLOCK;        /* DTI Configuration Lock Register */
};

#define TIMER0_BASE 0x40010000UL                /* TIMER0 base address */
#define TIMER1_BASE 0x40010400UL                /* TIMER1 base address */
#define TIMER2_BASE 0x40010800UL                /* TIMER2 base address */
#define TIMER0 ((struct TIMER *) TIMER0_BASE)   /* TIMER0 base pointer */
#define TIMER1 ((struct TIMER *) TIMER1_BASE)   /* TIMER1 base pointer */
#define TIMER2 ((struct TIMER *) TIMER2_BASE)   /* TIMER2 base pointer */


struct PRS_CH
{
  volatile uint32_t CTRL;          /* Channel Control Register */
};

struct PRS
{
  volatile uint32_t SWPULSE;       /* Software Pulse Register */
  volatile uint32_t SWLEVEL;       /* Software Level Register */
  volatile uint32_t ROUTE;         /* I/O Routing Register */

  uint32_t RESERVED0[1];           /* Reserved registers*/
  struct PRS_CH CH[6];             /* Channel registers*/

  uint32_t RESERVED1[6];           /* Reserved for future use */
  volatile uint32_t TRACECTRL;     /* MTB Trace Control Register */
};

#define PRS_BASE 0x400CC000UL             /* PRS base address */
#define PRS ((struct PRS *) PRS_BASE)     /* PRS base pointer */


struct ACMP
{
  volatile uint32_t CTRL;          /* Control Register */
  volatile uint32_t INPUTSEL;      /* Input Selection Register */
  volatile const uint32_t STATUS;  /* Status Register */
  volatile uint32_t IEN;           /* Interrupt Enable Register */
  volatile const uint32_t IF;      /* Interrupt Flag Register */
  volatile uint32_t IFS;           /* Interrupt Flag Set Register */
  volatile uint32_t IFC;           /* Interrupt Flag Clear Register */
  volatile uint32_t ROUTE;         /* I/O Routing Register */
};

#define ACMP0_BASE 0x40001000UL              /* ACMP0 base address */
#define ACMP0 ((struct ACMP *) ACMP0_BASE)   /* ACMP0 base pointer */


struct USB_DIEP
{
  volatile uint32_t CTL;          /* Device IN Endpoint x+1 Control Register */
  uint32_t RESERVED0[1];          /* Reserved for future use */
  volatile uint32_t INT;          /* Device IN Endpoint x+1 Interrupt Register */
  uint32_t RESERVED1[1];          /* Reserved for future use */
  volatile uint32_t TSIZ;         /* Device IN Endpoint x+1 Transfer Size Register */
  volatile uint32_t DMAADDR;      /* Device IN Endpoint x+1 DMA Address Register */
  volatile const uint32_t TXFSTS; /* Device IN Endpoint x+1 Transmit FIFO Status Register */
  uint32_t RESERVED2[1];          /* Reserved future */
};

struct USB_DOEP
{
  volatile uint32_t CTL;          /* Device OUT Endpoint x+1 Control Register */
  uint32_t RESERVED0[1];          /* Reserved for future use */
  volatile uint32_t INT;          /* Device OUT Endpoint x+1 Interrupt Register */
  uint32_t RESERVED1[1];          /* Reserved for future use */
  volatile uint32_t TSIZ;         /* Device OUT Endpoint x+1 Transfer Size Register */
  volatile uint32_t DMAADDR;      /* Device OUT Endpoint x+1 DMA Address Register */
  uint32_t RESERVED2[2];          /* Reserved future */
};

