gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
struct USB
{
  volatile uint32_t CTRL;              /* System Control Register */
  volatile const uint32_t STATUS;      /* System Status Register */
  volatile const uint32_t IF;          /* Interrupt Flag Register */
  volatile uint32_t IFS;               /* Interrupt Flag Set Register */
  volatile uint32_t IFC;               /* Interrupt Flag Clear Register */
  volatile uint32_t IEN;               /* Interrupt Enable Register */
  volatile uint32_t ROUTE;             /* I/O Routing Register */

  uint32_t RESERVED0[61435];           /* Reserved for future use */
  volatile uint32_t GAHBCFG;           /* AHB Configuration Register */
  volatile uint32_t GUSBCFG;           /* USB Configuration Register */
  volatile uint32_t GRSTCTL;           /* Reset Register */
  volatile uint32_t GINTSTS;           /* Interrupt Register */
  volatile uint32_t GINTMSK;           /* Interrupt Mask Register */
  volatile const uint32_t GRXSTSR;     /* Receive Status Debug Read Register */
  volatile const uint32_t GRXSTSP;     /* Receive Status Read and Pop Register */
  volatile uint32_t GRXFSIZ;           /* Receive FIFO Size Register */
  volatile uint32_t GNPTXFSIZ;         /* Non-periodic Transmit FIFO Size Register */

  uint32_t RESERVED1[12];              /* Reserved for future use */
  volatile uint32_t GDFIFOCFG;         /* Global DFIFO Configuration Register */

  uint32_t RESERVED2[41];              /* Reserved for future use */
  volatile uint32_t DIEPTXF1;          /* Device IN Endpoint Transmit FIFO 1 Size Register */
  volatile uint32_t DIEPTXF2;          /* Device IN Endpoint Transmit FIFO 2 Size Register */
  volatile uint32_t DIEPTXF3;          /* Device IN Endpoint Transmit FIFO 3 Size Register */

  uint32_t RESERVED3[444];             /* Reserved for future use */
  volatile uint32_t DCFG;              /* Device Configuration Register */
  volatile uint32_t DCTL;              /* Device Control Register */
  volatile const uint32_t DSTS;        /* Device Status Register */
  uint32_t RESERVED4[1];               /* Reserved for future use */
  volatile uint32_t DIEPMSK;           /* Device IN Endpoint Common Interrupt Mask Register */
  volatile uint32_t DOEPMSK;           /* Device OUT Endpoint Common Interrupt Mask Register */
  volatile const uint32_t DAINT;       /* Device All Endpoints Interrupt Register */
  volatile uint32_t DAINTMSK;          /* Device All Endpoints Interrupt Mask Register */

  uint32_t RESERVED5[5];               /* Reserved for future use */
  volatile uint32_t DIEPEMPMSK;        /* Device IN Endpoint FIFO Empty Interrupt Mask Register */

  uint32_t RESERVED6[50];              /* Reserved for future use */
  volatile uint32_t DIEP0CTL;          /* Device IN Endpoint 0 Control Register */
  uint32_t RESERVED7[1];               /* Reserved for future use */
  volatile uint32_t DIEP0INT;          /* Device IN Endpoint 0 Interrupt Register */
  uint32_t RESERVED8[1];               /* Reserved for future use */
  volatile uint32_t DIEP0TSIZ;         /* Device IN Endpoint 0 Transfer Size Register */
  volatile uint32_t DIEP0DMAADDR;      /* Device IN Endpoint 0 DMA Address Register */
  volatile const uint32_t DIEP0TXFSTS; /* Device IN Endpoint 0 Transmit FIFO Status Register */

  uint32_t RESERVED9[1];               /* Reserved registers */
  struct USB_DIEP DIEP[3];             /* Device IN Endpoint x+1 Registers */

  uint32_t RESERVED10[96];             /* Reserved for future use */
  volatile uint32_t DOEP0CTL;          /* Device OUT Endpoint 0 Control Register */
  uint32_t RESERVED11[1];              /* Reserved for future use */
  volatile uint32_t DOEP0INT;          /* Device OUT Endpoint 0 Interrupt Register */
  uint32_t RESERVED12[1];              /* Reserved for future use */
  volatile uint32_t DOEP0TSIZ;         /* Device OUT Endpoint 0 Transfer Size Register */
  volatile uint32_t DOEP0DMAADDR;      /* Device OUT Endpoint 0 DMA Address Register */

  uint32_t RESERVED13[2];              /* Reserved registers */
  struct USB_DOEP DOEP[3];             /* Device OUT Endpoint x+1 Registers */

  uint32_t RESERVED14[160];            /* Reserved for future use */
  volatile uint32_t PCGCCTL;           /* Power and Clock Gating Control Register */

  uint32_t RESERVED15[127];            /* Reserved registers */
  volatile uint32_t FIFO0D[384];       /* Device EP 0 FIFO */

  uint32_t RESERVED16[640];            /* Reserved registers */
  volatile uint32_t FIFO1D[384];       /* Device EP 1 FIFO */

  uint32_t RESERVED17[640];            /* Reserved registers */
  volatile uint32_t FIFO2D[384];       /* Device EP 2 FIFO */

  uint32_t RESERVED18[640];            /* Reserved registers */
  volatile uint32_t FIFO3D[384];       /* Device EP 3 FIFO */

  uint32_t RESERVED19[28288];          /* Reserved registers */
  volatile uint32_t FIFORAM[512];      /* Direct Access to Data FIFO RAM for Debugging (2 KB) */
};

#define USB_BASE 0x400C4000UL                /* USB base address */
#define USB ((struct USB *) USB_BASE)        /* USB base pointer */

#define USB_DINEPS   ((struct USB_DIEP *) &USB->DIEP0CTL)
#define USB_DOUTEPS  ((struct USB_DOEP *) &USB->DOEP0CTL)
#define USB_FIFOS    ((uint32_t *) &USB->FIFO0D)
#define USB_DIEPTXFS ((uint32_t *) &USB->DIEPTXF1)


struct ROMTABLE
{
  volatile const uint32_t PID4;        /* JEP_106_BANK */
  volatile const uint32_t PID5;        /* Unused */
  volatile const uint32_t PID6;        /* Unused */
  volatile const uint32_t PID7;        /* Unused */
  volatile const uint32_t PID0;        /* Chip family LSB, chip major revision */
  volatile const uint32_t PID1;        /* JEP_106_NO, Chip family MSB */
  volatile const uint32_t PID2;        /* Chip minor rev MSB, JEP_106_PRESENT, JEP_106_NO */
  volatile const uint32_t PID3;        /* Chip minor rev LSB */
  volatile const uint32_t CID0;        /* Unused */
};

#define ROMTABLE_BASE 0xF00FFFD0UL                   /* ROMTABLE base address */
#define ROMTABLE ((struct ROMTABLE *) ROMTABLE_BASE) /* ROMTABLE base pointer */

