gl-sergei/u2f-token/chopstx/mcu/efm32hg.h
struct ADC
{
  volatile uint32_t CTRL;                /* Control Register */
  volatile uint32_t CMD;                 /* Command Register */
  volatile const uint32_t STATUS;        /* Status Register */
  volatile uint32_t SINGLECTRL;          /* Single Sample Control Register */
  volatile uint32_t SCANCTRL;            /* Scan Control Register */
  volatile uint32_t IEN;                 /* Interrupt Enable Register */
  volatile const uint32_t IF;            /* Interrupt Flag Register */
  volatile uint32_t IFS;                 /* Interrupt Flag Set Register */
  volatile uint32_t IFC;                 /* Interrupt Flag Clear Register */
  volatile const uint32_t SINGLEDATA;    /* Single Conversion Result Data */
  volatile const uint32_t SCANDATA;      /* Scan Conversion Result Data */
  volatile const uint32_t SINGLEDATAP;   /* Single Conversion Result Data Peek Register */
  volatile const uint32_t SCANDATAP;     /* Scan Sequence Result Data Peek Register */
  volatile uint32_t CAL;                 /* Calibration Register */

  uint32_t RESERVED0[1];                 /* Reserved for future use */
  volatile uint32_t BIASPROG;            /* Bias Programming Register */
};

#define ADC0_BASE (0x40002000UL)         /* ADC0 base address */
#define ADC0 ((struct ADC *) ADC0_BASE)  /* ADC0 base pointer */

struct DEVINFO
{
  volatile const uint32_t CAL;          /* Calibration temperature and checksum */
  volatile const uint32_t ADC0CAL0;     /* ADC0 Calibration register 0 */
  volatile const uint32_t ADC0CAL1;     /* ADC0 Calibration register 1 */
  volatile const uint32_t ADC0CAL2;     /* ADC0 Calibration register 2 */
  uint32_t RESERVED0[2];                /* Reserved */
  volatile const uint32_t IDAC0CAL0;    /* IDAC0 calibration register */
  volatile const uint32_t USHFRCOCAL0;  /* USHFRCO calibration register */
  uint32_t RESERVED1[1];                /* Reserved */
  volatile const uint32_t AUXHFRCOCAL0; /* AUXHFRCO calibration register 0 */
  volatile const uint32_t AUXHFRCOCAL1; /* AUXHFRCO calibration register 1 */
  volatile const uint32_t HFRCOCAL0;    /* HFRCO calibration register 0 */
  volatile const uint32_t HFRCOCAL1;    /* HFRCO calibration register 1 */
  volatile const uint32_t MEMINFO;      /* Memory information */
  uint32_t RESERVED2[2];                /* Reserved */
  volatile const uint32_t UNIQUEL;      /* Low 32 bits of device unique number */
  volatile const uint32_t UNIQUEH;      /* High 32 bits of device unique number */
  volatile const uint32_t MSIZE;        /* Flash and SRAM Memory size in KiloBytes */
  volatile const uint32_t PART;         /* Part description */
};

#define DEVINFO_BASE (0x0FE081B0UL)               /* DEVINFO base address */
#define DEVINFO ((struct DEVINFO *) DEVINFO_BASE) /* DEVINFO base pointer */

struct MSC
{
  volatile uint32_t CTRL;               /* Memory System Control Register  */
  volatile uint32_t READCTRL;           /* Read Control Register  */
  volatile uint32_t WRITECTRL;          /* Write Control Register  */
  volatile uint32_t WRITECMD;           /* Write Command Register  */
  volatile uint32_t ADDRB;              /* Page Erase/Write Address Buffer  */

  uint32_t RESERVED0[1];                /* Reserved for future use **/
  volatile uint32_t WDATA;              /* Write Data Register  */
  volatile const uint32_t STATUS;       /* Status Register  */

  uint32_t RESERVED1[3];                /* Reserved for future use **/
  volatile const uint32_t IF;           /* Interrupt Flag Register  */
  volatile uint32_t IFS;                /* Interrupt Flag Set Register  */
  volatile uint32_t IFC;                /* Interrupt Flag Clear Register  */
  volatile uint32_t IEN;                /* Interrupt Enable Register  */
  volatile uint32_t LOCK;               /* Configuration Lock Register  */
  volatile uint32_t CMD;                /* Command Register  */
  volatile const uint32_t CACHEHITS;    /* Cache Hits Performance Counter  */
  volatile const uint32_t CACHEMISSES;  /* Cache Misses Performance Counter  */
  uint32_t RESERVED2[1];                /* Reserved for future use **/
  volatile uint32_t TIMEBASE;           /* Flash Write and Erase Timebase  */
  volatile uint32_t MASSLOCK;           /* Mass Erase Lock Register  */
  volatile uint32_t IRQLATENCY;         /* Irq Latency Register  */
};

#define MSC_BASE (0x400C0000UL)        /* MSC base address */
#define MSC ((struct MSC *) MSC_BASE)  /* MSC base pointer */


struct WDOG
{
  volatile uint32_t CTRL;              /* Control Register */
  volatile uint32_t CMD;               /* Command Register */
  const volatile uint32_t SYNCBUSY;    /* Synchronization Busy Register */
};

#define WDOG_BASE (0x40088000UL)         /* WDOG base address */
#define WDOG ((struct WDOG *) WDOG_BASE) /* WDOG base pointer */


struct SCB
{
  volatile const uint32_t CPUID;  /* Offset: 0x000 (R/ )  CPUID Base Register */
  volatile uint32_t ICSR;         /* Offset: 0x004 (R/W)  Interrupt Control and State Register */
  volatile uint32_t VTOR;         /* Offset: 0x008 (R/W)  Vector Table Offset Register */
  volatile uint32_t AIRCR;        /* Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register */
  volatile uint32_t SCR;          /* Offset: 0x010 (R/W)  System Control Register */
  volatile uint32_t CCR;          /* Offset: 0x014 (R/W)  Configuration Control Register */
  uint32_t RESERVED1;
  volatile uint32_t SHP[2U];      /* Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED */
  volatile uint32_t SHCSR;        /* Offset: 0x024 (R/W)  System Handler Control and State Register */
};

#define SCB_BASE (0XE000ED00UL)       /* System Control Block Base address */
#define SCB ((struct SCB*) SCB_BASE)  /* SCB configuration struct */
